<a href="https://colab.research.google.com/github/rajasreekalli/datascience-dojo/blob/main/Copy_of_Exploring_City_Pops.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Exploring City Populations


Always make a copy of the notebook first! 

0) Mount your drive and read in the Total Population by City [dataset](https://drive.google.com/file/d/1-fOFYQvP23Xmn1FwG17RSCw2dKf4f9vJ/view?usp=sharing
)

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [8]:
# import pandas

import pandas as pd
# read in the excel file and name your dataframe (df is common, but unoriginal)
df = pd.read_excel('/content/drive/MyDrive/Total_Population_By_City_Acs_2015.xlsx')
# explore the top 5 rows of dataframe (this is the head)
df.head()

   Table_Id          City  Summary_Level  ...  State State_Fips Total_Population
0    100001  Coffman Cove            160  ...     AK          2              150
1    100002         Cohoe            160  ...     AK          2             1577
2    100003      Cold Bay            160  ...     AK          2               46
3    100004      Coldfoot            160  ...     AK          2               10
4    100005       College            160  ...     AK          2            14675

[5 rows x 8 columns]

Now that you have read the data set into Python, you can explore it!

1) How many rows and columns are in the data set?

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29574 entries, 0 to 29573
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Table_Id          29574 non-null  int64
 1   City              29574 non-null  object
 2   Summary_Level     29574 non-null  int64
 3   Place_Fips        29574 non-null  int64
 4   Geo_Id            29574 non-null  object
 5   State             29574 non-null  object
 6   State_Fips        29574 non-null  int64
 7   Total_Population  29574 non-null  int64
dtypes: int64(5), object(3)
memory usage: 1.8+ MB

2) What is the data type of the "Table_Id" Column and what is the data type of the "City" Column?

In [11]:
df.dtypes['Table_Id']

dtype('int64')

3) Find the maxumum value for the Total_Population column

In [13]:
df['Total_Population'].max()

8426743

4) Find the minimum value for the Total_Population column.

In [14]:
df['Total_Population'].min()

0

5) What is the average population based on all cities?

In [15]:
df['Total_Population'].mean()

8043.275275579901

6) What happens if you try to find the mean of the Geo_Id column? Why does this happen?

In [16]:
# df['Geo_Id'].mean()

7) Sort the dataframe by Total_Population. Use the results to list a few cities that show a popoulation of 0.

In [19]:
df.sort_values('Total_Population')

       Table_Id          City  ...  State_Fips  Total_Population
2551     102552      Wilsonia  ...           6                 0
28979    128980        Bowden  ...          54                 0
23966    123967   Bijou Hills  ...          46                 0
4525     104526   Lake Harbor  ...          12                 0
188      100189   Petersville  ...           2                 0
...         ...           ...  ...         ...               ...
21819    121820  Philadelphia  ...          42           1555072
26469    126470       Houston  ...          48           2217706
7773     107774       Chicago  ...          17           2717534
3304     103305   Los Angeles  ...           6           3900794
18940    118941      New York  ...          36           8426743

[29574 rows x 8 columns]

8) Now sort by Total_Population so that the largest value is first.  Based on this 2015 data set, what is the 5th ranking city based on Total_Population?

In [49]:
df.sort_values('Total_Population', ascending = False).head(10)

       Table_Id          City  ...  State_Fips  Total_Population
18940    118941      New York  ...          36           8426743
3304     103305   Los Angeles  ...           6           3900794
7773     107774       Chicago  ...          17           2717534
26469    126470       Houston  ...          48           2217706
21819    121820  Philadelphia  ...          42           1555072
1679     101680       Phoenix  ...           4           1514208
25433    125434   San Antonio  ...          48           1413881
2217     102218     San Diego  ...           6           1359791
26148    126149        Dallas  ...          48           1260688
2228     102229      San Jose  ...           6           1000860

[10 rows x 8 columns]

9) Now sort the "City Column".  Which city is first in alphabetical order?

In [27]:
df.sort_values('City')

       Table_Id  ... Total_Population
23039    123040  ...              523
23050    123051  ...              281
919      100920  ...               52
10769    110770  ...            12381
5051     105052  ...             2860
...         ...  ...              ...
12381    112382  ...             3325
17794    117795  ...             9494
9779     109780  ...              104
5946     105947  ...              125
10768    110769  ...             2134

[29574 rows x 8 columns]

10) A useful tool for an overview of numerical data types is .describe().  Note that it will peform calculations on any columns that are floats or integers.  (Do these calculations provide useful information for all of the columns shown? Explain)

In [28]:
df.describe()

            Table_Id  Summary_Level  ...    State_Fips  Total_Population
count   29574.000000        29574.0  ...  29574.000000      2.957400e+04
mean   114787.500000          160.0  ...     29.863224      8.043275e+03
std      8537.422767            0.0  ...     15.769115      6.752158e+04
min    100001.000000          160.0  ...      1.000000      0.000000e+00
25%    107394.250000          160.0  ...     17.000000      3.340000e+02
50%    114787.500000          160.0  ...     30.000000      1.099500e+03
75%    122180.750000          160.0  ...     42.000000      4.097750e+03
max    129574.000000          160.0  ...     72.000000      8.426743e+06

[8 rows x 5 columns]

11) A very useful tool for categorical variables such as State is .value_counts().  It will tell you how many data points correspond to each category. Use this feature to quickly see how many entries there are for each state.  How many cities were included for PA? TX? What about your state?

In [50]:
df['State'].value_counts()

PA    1762
TX    1747
CA    1522
IL    1368
OH    1215
NY    1196
MO    1033
IA    1008
FL     918
MN     903
WI     777
OK     743
NC     739
MI     692
IN     679
KS     671
WA     627
GA     625
VA     593
AL     585
NE     580
NJ     545
AR     541
KY     539
MD     518
LA     474
CO     458
AZ     451
NM     443
TN     429
WV     405
ND     401
SC     396
SD     391
OR     377
MT     364
MS     362
AK     355
UT     325
PR     253
MA     246
ID     227
WY     204
HI     151
CT     143
NV     131
ME     130
VT     121
NH      97
DE      77
RI      36
DC       1
Name: State, dtype: int64

12) Now we want to just focus on the cities in Rhode Island (RI).  Assign a variable called RI that filters our dataset down to just the information from cities in Rhode Island.

In [56]:
RI = df[df['State'] == 'RI']
RI.head()

       Table_Id           City  ...  State_Fips  Total_Population
23523    123524        Ashaway  ...          44              1108
23524    123525       Bradford  ...          44              1158
23525    123526       Carolina  ...          44               787
23526    123527  Central Falls  ...          44             19378
23527    123528    Charlestown  ...          44              1207

[5 rows x 8 columns]

13) Next, create a dataset called "Carolinas" that includes both North Carolina (NC) and South Carolina (). How many cities does this include?

In [58]:
Carolinas = df[(df.State == 'NC') | (df.State == 'SC')]
len(Carolinas)

1135

14) Create a dataframe called Big_NY that includes information for cities in NY that are greater than 100,000 total population.  How many cities are included?

In [55]:
Big_NY = df[(df.State == 'NY') & (df.Total_Population > 100000)]
len(Big_NY)

5

15) Find the average population of cities in each state.

In [57]:
# I'm trying to find the average population by state
df.groupby('State')['Total_Population'].mean()

State
AK      2008.163380
AL      5414.818803
AR      3705.785582
AZ     13661.392461
CA     23889.193167
CO      9901.165939
CT     15357.566434
DC    647484.000000
DE      5245.870130
FL     16374.882353
GA      7665.374400
HI      8970.788079
IA      2468.273810
ID      5037.264317
IL      8281.089912
IN      6675.684831
KS      3609.050671
KY      4782.081633
LA      6432.909283
MA     19201.739837
MD      9459.480695
ME      4766.107692
MI      7983.783237
MN      4963.775194
MO      4110.100678
MS      4558.215470
MT      1938.464286
NC      7962.017591
ND      1425.805486
NE      2543.736207
NH      6470.701031
NJ      9825.372477
NM      3920.808126
NV     20201.038168
NY     13374.439799
OH      6709.440329
OK      4051.701211
OR      8322.148541
PA      4026.451759
PR      8029.193676
RI     18050.666667
SC      5646.414141
SD      1650.322251
TN      9495.170163
TX     11936.333143
UT      8559.236923
VA      9530.084317
VT      2004.933884
WA      9231.826156
WI      5419.214929
WV      1996.864198
WY      2224.318627
Name: Total_Population, dtype: float64

Keep exploring and practicing asking questions about the data and finding answers through your code! Data scientists have to answer questions, but often have to ask them first!  Think of at least 5 questions that will give you practice with your new data frame skills and answer them!

Question 1:

Question 2:

Question 3:

Question 4:

Question 5: